# GetNamingRule Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PDFExportOptions..::..GetNamingRule Method
PDFExportOptions Class See Also
---
Gets a copy of the naming rule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public IList<TableCellCombinedParameterData> GetNamingRule()
```

Visual Basic
---
```text
Public Function GetNamingRule As IList(Of TableCellCombinedParameterData)
```

Visual C++
---
```text
public:
IList<TableCellCombinedParameterData^>^ GetNamingRule()
```

# ### Return Value
The naming rule.
# See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace